In [ ]:
# 1D arrays are series
# 2D arrays are dataframes
# pandas is mostly for data cleaning and ML

# array banauni vaye numpy nei use garnu parcha

In [ ]:
import pandas as pd
import numpy as np

data = pd.Series([0.25, 0.5, 0.75, 1.0])
data1 = np.array([0.25, 0.5, 0.75, 1.0])
print("Series: ", data)
print("Array: ", data1)

Series:  0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64
Array:  [0.25 0.5  0.75 1.  ]

In [ ]:
# Series le tabular structure ma rakhdyo

In [ ]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [ ]:
# series ko value sabai array mei store huncha

In [ ]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
data[2]

np.float64(0.75)

In [ ]:
# numpy array defines implicitly
# pandas series is explicitly defined

data = pd.Series([0.25, 0.5, 0.75, 1.0], index=["a", "b", "c", "d"])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [ ]:
data['c']

np.float64(0.75)

In [ ]:
population_dic = {
    "California": 38,
    "Texas": 26,
    "New York": 20,
    "Florida": 19,
    "Illinois": 13,
}

population = pd.Series(population_dic)
population

California    38
Texas         26
New York      20
Florida       19
Illinois      13
dtype: int64

In [ ]:
# keys lai index ma halyo ani values side ma

In [ ]:
# explicit ma chai last item pani lincha explicitly vako le

population["California":"New York"]

California    38
Texas         26
New York      20
dtype: int64

In [ ]:
pd.Series(7, index=[10, 20, 30, 30])

10    7
20    7
30    7
30    7
dtype: int64

In [ ]:
pd.Series({2: "a", 5: "b", 3: "c"})

2    a
5    b
3    c
dtype: object

In [ ]:
# user's code overrides the library
pd.Series({2: "a", 5: "b", 3: "c"}, index=[3, 2])

3    c
2    a
dtype: object

In [ ]:
# 2D - dataframes

In [ ]:
# 2D - dataframes

area_dic = {
    "California": 423,
    "Texas": 695,
    "New York": 141,
    "Florida": 170,
    "Illinois": 150,
}

area = pd.Series(area_dic)
area

California    423
Texas         695
New York      141
Florida       170
Illinois      150
dtype: int64

In [ ]:
states = pd.DataFrame({"population": population, "area": area})

In [ ]:
states

            population  area
California          38   423
Texas               26   695
New York            20   141
Florida             19   170
Illinois            13   150

In [ ]:
# matrix form ma garo hunthyo so we just did in dataframe for visualization

In [ ]:
type(states)

pandas.core.frame.DataFrame

In [ ]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [ ]:
states.columns

Index(['population', 'area'], dtype='object')

In [ ]:
states['area']

California    423
Texas         695
New York      141
Florida       170
Illinois      150
Name: area, dtype: int64

In [ ]:
print(population)

California    38
Texas         26
New York      20
Florida       19
Illinois      13
dtype: int64

In [ ]:
pd.DataFrame(population, columns=["population"])

            population
California          38
Texas               26
New York            20
Florida             19
Illinois            13

In [ ]:
# population series thyo tyo chai column ma rakheko

In [ ]:
data = [{"a": i, "b": 2 * i} for i in range(6)]
pd.DataFrame(data)
data

[{'a': 0, 'b': 0},
 {'a': 1, 'b': 2},
 {'a': 2, 'b': 4},
 {'a': 3, 'b': 6},
 {'a': 4, 'b': 8},
 {'a': 5, 'b': 10}]

In [ ]:
pd.DataFrame(data)

   a   b
0  0   0
1  1   2
2  2   4
3  3   6
4  4   8
5  5  10

In [ ]:
# table ma kei data chaina vaney chai pandas le NaN rakhdincha

In [ ]:
# NaN is not a number

In [ ]:
pd.DataFrame([{"a": 0, "b": 1}, {"b": 2, "c": 3}])

     a  b    c
0  0.0  1  NaN
1  NaN  2  3.0

In [ ]:
# NaN ma kei operation garyo vaney NaN nei aucha so data cleaning ma first step is to check NaN values

In [ ]:
#interview question
# data exploration is the starting point 
# such as .ndim, .shape, .size, .dtype, .describe, .info

In [ ]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=["a", "b", "c", "d"])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [ ]:
data.keys() # check what the keys we have

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [ ]:
data.items()

In [ ]:
print(data.items())

<zip object at 0x00000201F2B3CB00>

In [ ]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [ ]:
data['e'] = 1.25

In [ ]:
data['d'] = 1.25

In [ ]:
data

a    0.25
b    0.50
c    0.75
d    1.25
e    1.25
dtype: float64

In [ ]:
data = pd.Series(["x", "y", "z"], index=[1, 3, 5])

In [ ]:
data[1]

'x'

In [ ]:
# user defined priority thyo 1 index ma

In [ ]:
# loc = location and iloc = implicit location

In [ ]:
data.loc[1]

'x'

In [ ]:
data.iloc[1]

'y'

In [ ]:
# explicit is better than implicit

In [ ]:
states

            population  area
California          38   423
Texas               26   695
New York            20   141
Florida             19   170
Illinois            13   150

In [ ]:
states["density"] = states["population"] / states["area"]

In [ ]:
states

            population  area   density
California          38   423  0.089835
Texas               26   695  0.037410
New York            20   141  0.141844
Florida             19   170  0.111765
Illinois            13   150  0.086667